html/docker/kubernates-handbook/theory/pod/preset.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pod Preset</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="hook.html"> UP </a>
 |
 <a accesskey="H" href="pod.html"> HOME </a>
</div><div id="content">
<h1 class="title">Pod Preset</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63469bc">目的</a></li>
<li><a href="#org0df23ed">原理</a></li>
<li><a href="#orgea5aa8d">启用 Pod Preset</a></li>
<li><a href="#org2232e20">禁用特定 Pod 的 Pod Preset</a></li>
</ul>
</div>
</div>
<pre class="example" id="orga2e66aa">
注意：PodPreset 资源对象只有 kubernetes 1.8 以上版本才支持
</pre>

<p>
Preset 就是预设，有时候想要让一批容器在启动的时候就注入一些信息，比如 <span class="underline">secret</span> 、 <span class="underline">volume</span> 、 <span class="underline">volume mount</span> 和 <span class="underline">环境变量</span> ，而又不想一个一个的改这些 Pod 的 template，这时候就可以用到 PodPreset 这个资源对象了 
</p>
<div id="outline-container-org63469bc" class="outline-2">
<h2 id="org63469bc">目的</h2>
<div class="outline-text-2" id="text-org63469bc">
<p>
Pod <span class="underline">Preset</span> 是用来在 Pod 被 <span class="underline">创建</span> 的时候向其中 <b>注入</b> <span class="underline">额外的运行时需求</span> 的 <span class="underline">API 资源</span> ：
</p>
<ul class="org-ul">
<li>可以使用 <span class="underline">label selector</span> 来指定为哪些 Pod 应用 Pod Preset</li>
<li><p>
使用 Pod Preset 使得 pod 模板的作者可以不必为每个 Pod 明确提供所有信息
</p>
<pre class="example" id="org42abb70">
这样一来，pod 模板的作者就不需要知道关于该服务的所有细节
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-org0df23ed" class="outline-2">
<h2 id="org0df23ed">原理</h2>
<div class="outline-text-2" id="text-org0df23ed">
<p>
Kubernetes 提供了一个准入控制器 <span class="underline">PodPreset</span> ，当其启用时，Pod Preset 会将应用创建请求传入到该控制器上。当有 Pod 创建请求发生时，系统将执行以下操作：
</p>
<ol class="org-ol">
<li>检索所有可用的 PodPresets</li>
<li>检查 PodPreset 标签选择器上的标签，看看其是否能够匹配正在创建的 Pod 上的标签</li>
<li>尝试将由 PodPreset 定义的各种资源合并到正在创建的 Pod 中</li>
<li>出现错误时，在该 Pod 上引发记录合并错误的事件，PodPreset 不会注入任何资源到创建的 Pod 中</li>
<li>注释刚生成的修改过的 Pod spec，以表明它已被 PodPreset 修改过
<ul class="org-ul">
<li>注释的格式为 <span class="underline">podpreset.admission.kubernetes.io/podpreset-&lt;pod-preset name&gt;": "&lt;resource version&gt;"</span></li>
</ul></li>
</ol>

<pre class="example" id="orgc5db7a2">
注意：Pod Preset 可以在适当的时候修改 Pod spec 中的 spec.containers 字段

Pod Preset 中的资源定义将不会应用于 initContainers 字段
</pre>

<p>
每个 Pod 可以匹配零个或多个 Pod Prestet，并且每个 PodPreset 可以应用于零个或多个 Pod。PodPreset 应用于 <span class="underline">一个或多个</span> Pod 时，Kubernetes 会 <b>修改 Pod Spec</b> ：
</p>
<ul class="org-ul">
<li>对于 Env、EnvFrom 和 VolumeMounts 的更改，Kubernetes 修改 Pod 中 <span class="underline">所有容器</span> 的容器 spec</li>
<li>对于 Volume 的更改，Kubernetes 修改 Pod Spec</li>
</ul>
</div>
</div>

<div id="outline-container-orgea5aa8d" class="outline-2">
<h2 id="orgea5aa8d">启用 Pod Preset</h2>
<div class="outline-text-2" id="text-orgea5aa8d">
<p>
为了在群集中使用 Pod Preset，必须确保以下内容：
</p>
<ol class="org-ol">
<li><p>
已启用 <span class="underline">settings.k8s.io/v1alpha1/podpreset</span> API 类型
</p>
<pre class="example" id="org92a91cf">
例如，可以通过在 API server 的 --runtime-config 选项中包含 settings.k8s.io/v1alpha1=true 来完成此操作
</pre></li>
<li><p>
已启用 <span class="underline">PodPreset 准入控制器</span> 
</p>
<pre class="example" id="orge5975a3">
一种方法是将 PodPreset 包含在为 API server 指定的 --admission-control 选项值中
</pre></li>
<li>已经在要使用的命名空间中通过 <b>创建</b> <span class="underline">PodPreset</span> 对象来定义 PodPreset</li>
</ol>
</div>
</div>

<div id="outline-container-org2232e20" class="outline-2">
<h2 id="org2232e20">禁用特定 Pod 的 Pod Preset</h2>
<div class="outline-text-2" id="text-org2232e20">
<pre class="example" id="org8e9431f">
在某些情况下，可能不希望 Pod 被任何 Pod Preset 所改变
</pre>
<p>
在这些情况下，可以在 Pod 的 Pod Spec 中添加注释： <span class="underline">podpreset.admission.kubernetes.io/exclude："true"</span> 
</p>

<p>
<a href="pdb.html">Next：Pod PDB</a>
</p>

<p>
<a href="hook.html">Previous：Pod Hook</a>
</p>

<p>
<a href="pod.html">Home: pod</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
